Revit 2027 API
ParameterTypeId.FillPatternIdParam Property
 "Cut fill pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FillPatternIdParam { get; }
Public Shared ReadOnly Property FillPatternIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FillPatternIdParam {
	ForgeTypeId^ get ();
}
static member FillPatternIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace